Autodesk.Revit.DB.FailuresAccessor.JournalFailures(System.Collections.Generic.IList`1{Autodesk.Revit.DB.FailureMessageAccessor})
Allows to record information about failures in the journal.
Remarks:
Records information about failure messages and elements involved in the failures.
If this method not invoked, journal does not contain any information about failures
resolved by (pre)processing.
failures:
Accessors to the failures to journal.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.DeleteElements(System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementId})
Resolves failures by deletion of elements related to the failures.
idsToDelete:
Ids of elements to be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Resolution of the failures by deleting idsToDelete is not permitted
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.ResolveFailures(System.Collections.Generic.IList`1{Autodesk.Revit.DB.FailureMessageAccessor})
Resolves one or more failures using last set failure resolution type for each of the failures.
If failure resolution type was not set for some of failures, default failure resolution type will be used.
Remarks:
After execution of the failure resolutions the failures will not be removed from the document automatically. To
prevent failure from being delivered to the user, failures (pre)processor should return ProceedWithCommit.
It will cause failures to be regenerated and failure resolution process to be restarted.
If attempt to resolve failure was not successful, and the same failure is present on repetitive calls
of the failures (pre)processor, 	the preprocessor code should take care to attempt
a different resolution the next time the failure appears, to avoid an infinite loop.
failures:
The accessors to the failures to be resolved.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Default resolution of one of the failures is not permitted or not applicable.
-or-
One of the failures was already attempted to resolve twice with that resolution type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
-or-
Resolution of failures is not permitted in the current state of the document.
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.IsElementsDeletionPermitted(System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementId},System.String@)
Checks if resolution of the failures by deleting given collection of elements is permitted.
Remarks:
Method does not confirm if deletion of the elements will or may resolve the failure - it simply verifies
that given elements can be deleted in the current state of the document.
idsToDelete:
The Ids of elements to be deleted.
reason:
A localized string explaining reason why the elements cannot be deleted.
Returns:
True if resolution of the failures by deleting given elements is permitted
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011

Autodesk.Revit.DB.FailuresAccessor.IsElementsDeletionPermitted(System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementId})
Checks if resolution of the failures by deleting given collection of elements is permitted.
Remarks:
Method does not confirm if deletion of the elements will or may resolve the failure - it simply verifies
that given elements exist and can be deleted in the current state of the document.
idsToDelete:
The Ids of elements to be deleted.
Returns:
True if resolution of the failures by deleting given elements is permitted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailuresAccessor is inactive (is used outside of failures processing).
Since:
2011